Ran Plan for project: `project-dev` dir: `terraform/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
hi

ASIA4GSKCISGXXCUQKWB

UqaupicX1wMuNQSMWPhFWpF+d0DQ/JvA6LhhEBTo

IQoJb3JpZ2luX2VjEGQaCXVzLWVhc3QtMSJIMEYCIQDMa/1ql6lAB9CsZwe4dns4bRDm77LGAkTWZyNaG+4kQQIhAJ82E9nB7/WOzsLkk0gnAMskZWhJK2vt/0VXB1S/Y6DlKpwCCC0QAhoMODM4NzQ3NzAyNDEzIgyMB/MJnGZqSX1/jYMq+QGeHePMLPSZPxXEbl6IXgIpUawMX5MYTthD0bfeHBTQIvPt4bj3sHpR70XVP/sIW1g5Z9AxbrJxhBqdsebjNtDVjnqkco7qZZxJv94UmMfFHicneEGgGyufOE/K2JcagM1Du2QIfae+yEwOXclI+hNpqEl9k6hrkGOiap/PP+FKAviS9nN6D9+5kolwdU0/xlIW7ZN8tD2f95y7ncIeQkM3NIxxkmWAbDimRefd91QQyiobJ0a72N68c6Iox2w+/anSvyUWhWQxDA3Mg0ko4AUSv6f70spq7cumw6Dot3KJKjyuuIJmyKUtV03agpXg4yP0tMqPlPt1oW8wm860tAY6nAFn0yiy8Pc5Oj4912dSQEIT/I7WZ6sp505cThiab1nY7c9tFyq60vRwOcddjZrrR1dbbailws5kkXI9AWMo16J2AQAj0jTgFxLdUqABdep6OBPbXvbQPyq5q1/ovY2OfcxnQAZWs6dhks1D+PewzM/2i0IkNm+Io+O2+wJ5mpUxZj7ogDazIUONxLYyt2hfqATI/KHDrRAPP5gFGkE=


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.example will be created
+ resource "aws_instance" "example" {
      + ami                                  = "ami-09b90e09742640522"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"       = "demo_instance_dev"
          + "managed_by" = "atlantis"
        }
      + tags_all                             = {
          + "Name"       = "demo_instance_dev"
          + "managed_by" = "atlantis"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p project-dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-6d5cfbbdc5-pmnx2:4141/lock?id=pranavs1995%252Fatlantis-demo%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p project-dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```